[
    {
        "title": "Delights Creamy Chocolate",
        "description": "Now you can indulge without all the guilt! Who knew that a whole pint of Creamy Chocolate ice cream was 270 calories, and tasted delicious too...we did! That's because here at Breyers®, we have over 150 years of experience making mouth-watering ice cream. We start with high quality ingredients, naturally sourced flavors, and all American dairy. This reduced fat ice cream will leave your taste buds in disbelief since it has 2.5 grams of fat and 7 grams of sugar in each serving. And it’s even a good source of protein! Try our rich, creamy low-fat chocolate ice cream made with real cocoa. It’s the ultimate chocolate-lover’s dream! So grab a spoon and see what we mean! Breyers® delights will leave your taste buds in disbelief, with 260-330 calories and 20 grams of protein per pint. Breyers® delights are available in eight yummy flavors, including Cookies and Cream, Creamy Chocolate, Mint Chip, Vanilla Bean, Raspberry Fudge Swirl, Vanilla Cupcake, Butter Pecan, and Caramel Brownie. We can't wait to hear which pint is your favorite flavor! Be sure to visit us at www.Breyers.com to learn more about our wide variety of delicious desserts! You can also check us out on Instagram at www.instagram.com/Breyers/ to see lots of delicious photos",
        "url": "https://www.breyers.com/us/en/products/delights-creamy-chocolate.html",
        "relevance": "0.66"
    },
    {
        "title": "Natural Vanilla",
        "description": "When William Breyer started his small ice cream business in Philadelphia in 1866, he based his recipes around simple and pure ingredients. Breyers® Natural Vanilla ice cream today still holds true to his ideals. What could be simpler than using ingredients like fresh cream, sugar, and milk? To make things even sweeter, the milk and cream are 100% Grade A and come from American cows not treated with artificial growth hormones*. We partner with our farmers all over America because milk and fresh cream are so important in one of our most popular ice cream flavors and the taste you love. Do you see those specks? Those are real vanilla beans. That heavenly vanilla in Natural Vanilla is also 100% sustainably sourced, so you can enjoy it even more, knowing that you’re supporting farmers and their families in Madagascar through our partnership with the Rainforest Alliance. We believe that the quality of our ingredients makes the most delicious vanilla ice cream, and that’s why even today we keep true to William Breyers® pledge of purity. Try Breyers® Natural Vanilla yourself and see if you those vanilla specks and refreshing milk and cream can scoop up some smiles in your family. Want to give your dessert a twist? Check out our recipes at www.Breyers.com/recipes for fun and easy ideas! * The FDA states that no significant difference has been shown between dairy derived from rBST-treated and non-rBST-treated cows.",
        "url":"https://www.breyers.com/us/en/products/natural-vanilla.html",
        "relevance":"0.87"
    },
    {
        "title": "Can Dogs Eat Ice Cream?",
        "description": "The first problem with ice cream is that dogs' bodies are not designed to digest milk after they are weaned, as puppies. Since ice cream is made with milk, feeding your dog ice cream could lead to gas, bloating, constipation, diarrhea, or vomiting. The second problem with ice cream is that it is loaded with sugar, and feeding your dog sugary foods can lead to weight gain, which can lead to other health problems. Even if the ice cream says it's sugarless, you need to be careful to read the label to make sure that no xylitol is used, as this sweetener is extremely toxic to dogs. The final problem with ice cream is that some flavors may actually be dangerous for dogs. Chocolate, for example, can be toxic for dogs because their bodies cannot efficiently process a component of the chocolate: theobromine.",
        "url":"https://www.akc.org/expert-advice/nutrition/can-dogs-eat-ice-cream/",
        "relevance":"0.41"
    },
    {
        "title": "Natural Strawberry",
        "description":"Sun-ripened California strawberries – so good! AND swirled around in a pint of delicious Breyers® ice cream? What could be better? Our Breyers® Natural Strawberry ice cream is packed with strawberries picked at the peak of happiness! Did we mention that our strawberries are also 100% sustainably sourced? In fact, our Natural Strawberry is delicious all around. We start with ingredients like milk, fresh cream, sugar and strawberries to give you a delicious ice cream. Our strawberries are pretty great, but that milk and cream is special too! We only use 100% Grade A milk and cream from American cows not treated with artificial growth hormones*. And to boot we use colors and flavors from natural sources and sustainable vanilla from Madagascar. Breyers® Strawberry is also made with Non-GMO sourced ingredients! Back in 1866 when William Breyer started his small ice cream operation in Philly, he also valued the quality of his ingredients. So much so, that he created a Pledge of Purity to stand behind the quality of his ice cream. More than 150 years later we still follow his same principles with our own Pledge to use only high quality ingredients in our desserts. We hope you agree that’s what makes our Breyers® Natural Strawberry so good! Give it a try and leave us a review at www.Breyers.com or follow us @Breyers on Instagram! * The FDA states that no significant difference has been shown between dairy derived from rBST-treated and non-rBST-treated cows.",
        "url":"https://www.breyers.com/us/en/products/natural-strawberry.html",
        "relevance":"0.75"
    }
]